I-SYST/EHAL/ARM/Nordic/src/ble_app_nrf51.cpp
    /* Set the public key */
    err_code = pm_lesc_public_key_set(&s_lesc_public_key);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Security Request timer timeout.
 *
 * @details This function will be called each time the Security Request timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void sec_req_timeout_handler(void * p_context)
{
    uint32_t err_code;

    if (g_BleAppData.ConnHdl != BLE_CONN_HANDLE_INVALID)
    {
        // Initiate bonding.
        //NRF_LOG_DEBUG("Start encryption\r\n");
        err_code = pm_conn_secure(g_BleAppData.ConnHdl, false);
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}

void BleAppAdvManDataSet(uint8_t *pData, int Len)
{
   uint32_t ret = ble_advdata_set(&g_BleAppData.AdvData, &g_BleAppData.SRData);
   APP_ERROR_CHECK(ret);
}

void BleAppAdvStart(BLEAPP_ADVMODE AdvMode)
{
	uint32_t err_code;

	if (g_BleAppData.AppMode == BLEAPP_MODE_NOCONNECT)
	{
		 err_code = sd_ble_gap_adv_start(&s_AdvParams);
	}
	else
	{
		err_code = ble_advertising_start((ble_adv_mode_t)AdvMode);
	}
    APP_ERROR_CHECK(err_code);
}

/**@brief Overloadable function for initializing the Advertising functionality.
 */
__WEAK void BleAppAdvInit(const BLEAPP_CFG *pCfg)
{
    uint32_t               err_code;

    memset(&g_BleAppData.AdvData, 0, sizeof(g_BleAppData.AdvData));
    memset(&g_BleAppData.SRData, 0, sizeof(g_BleAppData.SRData));

    s_BleAppManData.company_identifier = pCfg->VendorID;
    s_BleAppManData.data.p_data = (uint8_t*)pCfg->pManData;
    s_BleAppManData.data.size = pCfg->ManDataLen;

    g_BleAppData.AdvData.include_appearance = false;
    g_BleAppData.AdvData.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    if (pCfg->pDevName != NULL)
    {
    	if (strlen(pCfg->pDevName) < 14)
    	{
    		g_BleAppData.AdvData.name_type      = BLE_ADVDATA_SHORT_NAME;
    		g_BleAppData.AdvData.short_name_len = strlen(pCfg->pDevName);
    	}
    	else
    		g_BleAppData.AdvData.name_type = BLE_ADVDATA_FULL_NAME;
    }
    else
    {
    	g_BleAppData.AdvData.name_type = BLE_ADVDATA_NO_NAME;
    }

    if (g_BleAppData.AdvData.name_type == BLE_ADVDATA_NO_NAME)
    {
        if (pCfg->NbAdvUuid > 0 && pCfg->pAdvUuids != NULL)
        {
        	g_BleAppData.AdvData.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
        	g_BleAppData.AdvData.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;
			if (pCfg->pManData != NULL)
			{
				g_BleAppData.SRData.p_manuf_specific_data = &s_BleAppManData;
			}
        }
        else
        {
			if (pCfg->pManData != NULL)
			{
				g_BleAppData.AdvData.p_manuf_specific_data = &s_BleAppManData;
			}
        }
    }
    else
    {
        if (pCfg->NbAdvUuid > 0 && pCfg->pAdvUuids != NULL)
        {
        	g_BleAppData.SRData.uuids_complete.uuid_cnt = pCfg->NbAdvUuid;
        	g_BleAppData.SRData.uuids_complete.p_uuids  = (ble_uuid_t*)pCfg->pAdvUuids;
        }
        if (pCfg->pManData != NULL)
        {
        	g_BleAppData.AdvData.p_manuf_specific_data = &s_BleAppManData;
        }
    }

    if (pCfg->AppMode == BLEAPP_MODE_NOCONNECT || pCfg->AppMode == BLEAPP_MODE_IBEACON)
    {
        err_code = ble_advdata_set(&g_BleAppData.AdvData, &g_BleAppData.SRData);
        APP_ERROR_CHECK(err_code);

        // Initialize advertising parameters (used when starting advertising).
        memset(&s_AdvParams, 0, sizeof(s_AdvParams));

        s_AdvParams.type        = BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
        s_AdvParams.p_peer_addr = NULL;                             // Undirected advertisement.
        s_AdvParams.fp          = BLE_GAP_ADV_FP_ANY;
        s_AdvParams.interval    = pCfg->AdvInterval;
        s_AdvParams.timeout     = pCfg->AdvTimeout;
    }
    else
    {
		memset(&g_BleAppData.AdvConf, 0, sizeof(g_BleAppData.AdvConf));
    	g_BleAppData.AdvConf.ble_adv_fast_enabled  = true;
    	g_BleAppData.AdvConf.ble_adv_fast_interval = pCfg->AdvInterval;
    	g_BleAppData.AdvConf.ble_adv_fast_timeout  = pCfg->AdvTimeout;

		if (pCfg->AdvSlowInterval > 0)
		{
			g_BleAppData.AdvConf.ble_adv_slow_enabled  = true;
			g_BleAppData.AdvConf.ble_adv_slow_interval = pCfg->AdvSlowInterval;
			g_BleAppData.AdvConf.ble_adv_slow_timeout  = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;
		}

    }

	err_code = ble_advertising_init(&g_BleAppData.AdvData, &g_BleAppData.SRData, &g_BleAppData.AdvConf, on_adv_evt, NULL);
	APP_ERROR_CHECK(err_code);

	//memcpy(&g_BleAppData.AdvData, padvdata, sizeof(ble_advdata_t));
    //memcpy(&g_BleAppData.SRData, psrdata, sizeof(ble_advdata_t));
}

void BleAppDisInit(const BLEAPP_CFG *pBleAppCfg)
{
    ble_dis_init_t   dis_init;
    ble_dis_pnp_id_t pnp_id;

    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    if (pBleAppCfg->pDevDesc)
    {
    	ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char*)pBleAppCfg->pDevDesc->ManufName);
    	ble_srv_ascii_to_utf8(&dis_init.model_num_str, (char*)pBleAppCfg->pDevDesc->ModelName);
    	if (pBleAppCfg->pDevDesc->pSerialNoStr)
    		ble_srv_ascii_to_utf8(&dis_init.serial_num_str, (char*)pBleAppCfg->pDevDesc->pSerialNoStr);
    	if (pBleAppCfg->pDevDesc->pFwVerStr)
    		ble_srv_ascii_to_utf8(&dis_init.fw_rev_str, (char*)pBleAppCfg->pDevDesc->pFwVerStr);
    	if (pBleAppCfg->pDevDesc->pHwVerStr)
    		ble_srv_ascii_to_utf8(&dis_init.hw_rev_str, (char*)pBleAppCfg->pDevDesc->pHwVerStr);
    }

    pnp_id.vendor_id  = pBleAppCfg->VendorID;
    pnp_id.product_id = pBleAppCfg->ProductId;
    dis_init.p_pnp_id = &pnp_id;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    uint32_t err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);

}

uint16_t BleAppGetConnHandle()
{
	return g_BleAppData.ConnHdl;
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t * p_evt)
{
 /*   if ((g_BleAppData.ConnHdl == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
    {
       // m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
        //NRF_LOG_INFO("Data len is set to 0x%X(%d)\r\n", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
    }*/
   // NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x\r\n", p_gatt->att_mtu_desired_central, p_gatt->att_mtu_desired_periph);
}

