I-SYST/EHAL/ARM/Nordic/src/ble_app_nrf51.cpp
/**@brief Function for initializing the GATT library. */
void gatt_init(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_init(&s_Gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_periph_set(&s_Gatt, 64);
    APP_ERROR_CHECK(err_code);
}

bool BleAppConnectable(const BLEAPP_CFG *pBleAppCfg, bool bEraseBond)
{
	uint32_t err_code;


    err_code = nrf_crypto_public_key_compute(NRF_CRYPTO_CURVE_SECP256R1, &m_crypto_key_sk, &m_crypto_key_pk);
    APP_ERROR_CHECK(err_code);

    BleAppPeerMngrInit(pBleAppCfg->SecType, pBleAppCfg->SecExchg, bEraseBond);

    //BleAppInitUserData();

    BleAppGapParamInit(pBleAppCfg);

    BleAppInitUserServices();

    if (pBleAppCfg->bEnDevInfoService)
    	BleAppDisInit(pBleAppCfg);


    if (pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT)
    	conn_params_init();

    return true;
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
/*static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint16_t conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
    uint16_t role        = ble_conn_state_role(conn_handle);

    if (    (p_ble_evt->header.evt_id == BLE_GAP_EVT_CONNECTED)
        &&  (is_already_connected(&p_ble_evt->evt.gap_evt.params.connected.peer_addr)))
    {
        NRF_LOG_INFO("%s: Already connected to this device as %s (handle: %d), disconnecting.",
                     (role == BLE_GAP_ROLE_PERIPH) ? "PERIPHERAL" : "CENTRAL",
                     (role == BLE_GAP_ROLE_PERIPH) ? "CENTRAL"    : "PERIPHERAL",
                     conn_handle);

        (void)sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

        // Do not process the event further.
        return;
    }

    on_ble_evt(p_ble_evt);

    if (role == BLE_GAP_ROLE_PERIPH)
    {
        // Manages peripheral LEDs.
        on_ble_peripheral_evt(p_ble_evt);
    }
    else if ((role == BLE_GAP_ROLE_CENTRAL) || (p_ble_evt->header.evt_id == BLE_GAP_EVT_ADV_REPORT))
    {
        on_ble_central_evt(p_ble_evt);
    }
}
*/
/*
void sys_event_handler(uint32_t sys_evt, void * p_context)
{
    if (m_state != STATE_IDLE && m_state != STATE_ERROR)
    {
        switch (sys_evt)
        {
            case NRF_EVT_FLASH_OPERATION_SUCCESS:
                flash_operation_success_run();
                break;

            case NRF_EVT_FLASH_OPERATION_ERROR:
                if (!(m_flags & MASK_FLASH_API_ERR_BUSY))
                {
                    flash_operation_failure_run();
                }
                else
                {
                    // As our last flash operation request was rejected by the flash API reissue the
                    // request by doing same code execution path as for flash operation sucess
                    // event. This will promote code reuse in the implementation.
                    flash_operation_success_run();
                }
                break;

            default:
                // No implementation needed.
                break;
        }

    }
}
*/

/**
 * @brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
bool BleAppInit(const BLEAPP_CFG *pBleAppCfg, bool bEraseBond)
{
	ret_code_t err_code;

	g_BleAppData.ConnLedPort = pBleAppCfg->ConnLedPort;
	g_BleAppData.ConnLedPin = pBleAppCfg->ConnLedPin;

	if (pBleAppCfg->ConnLedPort != -1 && pBleAppCfg->ConnLedPin != -1)
    {
    	IOPinConfig(pBleAppCfg->ConnLedPort, pBleAppCfg->ConnLedPin, 0,
    				IOPINDIR_OUTPUT, IOPINRES_NONE, IOPINTYPE_NORMAL);
    }

	// initializing the cryptography module
    nrf_crypto_init();

    g_BleAppData.AppMode = pBleAppCfg->AppMode;
    g_BleAppData.ConnHdl = BLE_CONN_HANDLE_INVALID;

    switch (pBleAppCfg->AppMode)
    {
    	case BLEAPP_MODE_LOOP:
    	case BLEAPP_MODE_NOCONNECT:
    	case BLEAPP_MODE_IBEACON:
    		APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
        	//APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
            SOFTDEVICE_HANDLER_INIT((nrf_clock_lf_cfg_t*)&pBleAppCfg->ClkCfg, NULL);
    		break;
    	case BLEAPP_MODE_APPSCHED:
    		APP_TIMER_APPSH_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, true);
    		APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
            SOFTDEVICE_HANDLER_APPSH_INIT((nrf_clock_lf_cfg_t*)&pBleAppCfg->ClkCfg, true);
    		break;
    	case BLEAPP_MODE_RTOS:
    		if (pBleAppCfg->SDEvtHandler == NULL)
    			return false;
            SOFTDEVICE_HANDLER_INIT((nrf_clock_lf_cfg_t*)&pBleAppCfg->ClkCfg, pBleAppCfg->SDEvtHandler);
    		break;
    }


    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(pBleAppCfg->CentLinkCount,
                                                    pBleAppCfg->PeriLinkCount,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(pBleAppCfg->CentLinkCount, pBleAppCfg->PeriLinkCount);//CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);
    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
    if (pBleAppCfg->PeriLinkCount > 0 && pBleAppCfg->AdvInterval > 0)
    {
    	g_BleAppData.AppRole |= BLEAPP_ROLE_PERIPHERAL;
    }
    if (pBleAppCfg->CentLinkCount > 0)
    {
		g_BleAppData.AppRole |= BLEAPP_ROLE_CENTRAL;
		ret_code_t err_code = ble_db_discovery_init(BleAppDBDiscoveryHandler);
		APP_ERROR_CHECK(err_code);
    }

    if (pBleAppCfg->AppMode != BLEAPP_MODE_NOCONNECT)
    {
    	BleAppConnectable(pBleAppCfg, bEraseBond);
    }

    BleAppInitUserData();

    if (pBleAppCfg->pDevName != NULL)
    {
        err_code = sd_ble_gap_device_name_set(&s_gap_conn_mode,
                                          (const uint8_t *) pBleAppCfg->pDevName,
                                          strlen(pBleAppCfg->pDevName));
        APP_ERROR_CHECK(err_code);
    }

    BleAppAdvInit(pBleAppCfg);

    return true;
}

void BleAppRun()
{

	if (g_BleAppData.AppMode == BLEAPP_MODE_NOCONNECT)
	{
		uint32_t err_code = sd_ble_gap_adv_start(&s_AdvParams);
		APP_ERROR_CHECK(err_code);
	}
	else
	{
		if (g_BleAppData.AppRole & BLEAPP_ROLE_PERIPHERAL)
		{
			uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
			APP_ERROR_CHECK(err_code);
		}
	}

    while (1)
    {
		if (g_BleAppData.AppMode == BLEAPP_MODE_RTOS)
		{
			BleAppRtosWaitEvt();
			intern_softdevice_events_execute();
		}
		else
		{
			if (g_BleAppData.AppMode == BLEAPP_MODE_APPSCHED)
			{
				app_sched_execute();
			}
			sd_app_evt_wait();
		}
    }
}




